eis-cart-tests-master@3bc714a7387/tests/test-data/intf-specs/gswf/template/EIS_PricingProcessConsolidated/request.xmlt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
    <soapenv:Header/>
    <soapenv:Body>
        <even:RaiseEIS_PricingProcessConsolidatedAsynchron>
            <even:Downstream_BLANK_System_BLANK_Identifier>BRS_EOD_PRICE</even:Downstream_BLANK_System_BLANK_Identifier>
            <even:Extra_BLANK_Configuration_BLANK_Information>EIS_PricingProcessConsolidated</even:Extra_BLANK_Configuration_BLANK_Information>
            <even:FVGroupName>ESIFVPRP</even:FVGroupName>
            <even:FVPricePurpose>ESIFV</even:FVPricePurpose>
            <even:FVPriceType>SODEIS</even:FVPriceType>
            <even:Instruments>${INSTRUMENTS!}</even:Instruments>
            <even:IssueGroup>${ISSUE_GROUP1!}</even:IssueGroup>
            <even:IssueGroup>${ISSUE_GROUP2!}</even:IssueGroup>
            <even:NoOfBranches>10</even:NoOfBranches>
            <even:Observation_BLANK_Period>200</even:Observation_BLANK_Period>
            <even:PricePointEventDefinitionId>ESIPRPTEOD</even:PricePointEventDefinitionId>
            <even:Prior_BLANK_GPRC_BLANK_Observation_BLANK_Count>201</even:Prior_BLANK_GPRC_BLANK_Observation_BLANK_Count>
            <even:Processing_BLANK_Date>${PROCESSING_DATE}</even:Processing_BLANK_Date>
            <even:Qualifying_BLANK_type_BLANK_for_BLANK_Golden_BLANK_Price_BLANK_Check>VALID</even:Qualifying_BLANK_type_BLANK_for_BLANK_Golden_BLANK_Price_BLANK_Check>
            <even:RunFairValueDerivation>${RUN_FAIR_VALUE_DERIVATION!}</even:RunFairValueDerivation>
            <even:RunPVCForPRVI>${RUNPVCFORPRVI!}</even:RunPVCForPRVI>
            <even:RunThaiPriceDerivation>${RUN_THAI_PRICE_DERIVATION!}</even:RunThaiPriceDerivation>
            <even:RunUnlistedWarrantPriceDerivation>${RUN_UNLISTED_WARRANT_PRICE_DERIVATION!}</even:RunUnlistedWarrantPriceDerivation>
            <even:THForeignGroupName>ESITHAIFL</even:THForeignGroupName>
            <even:THPricePurpose>ESITHP</even:THPricePurpose>
            <even:THPriceType>DERIVE</even:THPriceType>
            <even:THPricingSource>ESTHF</even:THPricingSource>
            <even:THStaleBusinessDay>7</even:THStaleBusinessDay>
            <even:Threads_BLANK_In_BLANK_Parallel>20</even:Threads_BLANK_In_BLANK_Parallel>
	        <even:UWGroupName>UNLWARSOI</even:UWGroupName>
	        <even:UWOverlyingPriceType>DERIVE</even:UWOverlyingPriceType>
            <even:UWPricePurpose>ESIPX</even:UWPricePurpose>
            <even:UWPricingSource>ESALL</even:UWPricingSource>
            <even:UWUnderlyingPriceType>CL1D</even:UWUnderlyingPriceType>
        </even:RaiseEIS_PricingProcessConsolidatedAsynchron>
    </soapenv:Body>
</soapenv:Envelope>